CapturedDataPackage/OnvifTest/2015.3.30/3.Server192.168.1.230Response.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:wsr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:dndl="http://www.onvif.org/ver10/network/wsdl/DiscoveryLookupBinding"
    xmlns:dnrd="http://www.onvif.org/ver10/network/wsdl/RemoteDiscoveryBinding"
    xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl"
    xmlns:tanae="http://www.onvif.org/ver20/analytics/wsdl/AnalyticsEngineBinding"
    xmlns:tanre="http://www.onvif.org/ver20/analytics/wsdl/RuleEngineBinding"
    xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tetcp="http://www.onvif.org/ver10/events/wsdl/CreatePullPointBinding"
    xmlns:tete="http://www.onvif.org/ver10/events/wsdl/EventBinding"
    xmlns:tetnc="http://www.onvif.org/ver10/events/wsdl/NotificationConsumerBinding"
    xmlns:tetnp="http://www.onvif.org/ver10/events/wsdl/NotificationProducerBinding"
    xmlns:tetpp="http://www.onvif.org/ver10/events/wsdl/PullPointBinding"
    xmlns:tetpps="http://www.onvif.org/ver10/events/wsdl/PullPointSubscriptionBinding"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tetps="http://www.onvif.org/ver10/events/wsdl/PausableSubscriptionManagerBinding"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tetsm="http://www.onvif.org/ver10/events/wsdl/SubscriptionManagerBinding"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:timg10="http://www.onvif.org/ver10/imaging/wsdl"
    xmlns:tls="http://www.onvif.org/ver10/display/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
    xmlns:trp="http://www.onvif.org/ver10/replay/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
    xmlns:tse="http://www.onvif.org/ver10/search/wsdl"
    xmlns:tns1="http://www.onvif.org/ver10/schema"
    xmlns:tnsn="http://www.eventextension.com/2011/event/topics"
    xmlns:tnsavg="http://www.avigilon.com/onvif/ver10/topics">
    <SOAP-ENV:Header>
        <wsa:MessageID>uuid:6b28d3e4-0000-1000-a430-f9fb47f73416</wsa:MessageID>
        <wsa:RelatesTo>urn:uuid:16257d68a-1dd2-11b2-a105-010203040506</wsa:RelatesTo>
        <wsa:To>http://schemas.xmlsoap.org/ws/2005/04/addressing/role/anonymous</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:6b1cdaf3-0000-1000-95b5-953f05ec445</wsa:Address>
                </wsa:EndpointReference>
                <d:Types>dn:NetworkVideoTransmitter</d:Types>
                <d:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/type/Network_Video_Transmitter onvif://www.onvif.org/type/name onvif://www.onvif.org/type/video_analytics onvif://www.onvif.org/type/location onvif://www.onvif.org/factory_token/DC2462D-E362-4E42-92DE-39D8109CB4E4 onvif://www.onvif.org/type/ptz onvif://www.onvif.org/hardware/v047-1</d:Scopes>
                <d:XAddrs>http://192.168.1.230:80/onvif/device_service</d:XAddrs>
                <d:MetadataVersion>1</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
